class SinhaleseCharacters:
    sinhalese_chars = [
        "අ", "ආ", "ඇ", "ඈ", "ඉ", "ඊ",
        "උ", "ඌ", "ඍ", "ඎ", "ඏ", "ඐ",
        "එ", "ඒ", "ඓ", "ඔ", "ඕ", "ඖ",
        "ං", "ඃ"
             "ක", "ඛ", "ග", "ඝ", "ඞ", "ඟ",
        "ච", "ඡ", "ජ", "ඣ", "ඤ", "ඥ", "ඦ",
        "ට", "ඨ", "ඩ", "ඪ", "ණ", "ඬ",
        "ත", "ථ", "ද", "ධ", "න", "ඳ",
        "ප", "ඵ", "බ", "භ", "ම", "ඹ",
        "ය", "ර", "ල", "ව",
        "ශ", "ෂ", "ස", "හ", "ළ", "ෆ",
        "෴", "\u200d"
    ]

    sinhalese_vowel_signs = ["්", "ා", "ැ", "ෑ", "ි", "ී", "ු", "ූ", "ෘ", "ෙ", "ේ", "ෛ", "ො", "ෝ",
                             "ෞ", "ෟ", "ෲ", "ෳ", "ර්‍"]

    # dictionary that maps wrong usage of vowels to correct vowels
    vowel_sign_fix_dict = {
        "ෙ" + "්": "ේ",
        "්" + "ෙ": "ේ",

        "ෙ" + "ා": "ො",
        "ා" + "ෙ": "ො",

        "ේ" + "ා": "ෝ",
        "ො" + "්": "ෝ",

        "ෙෙ": "ෛ",
        "ෘෘ": "ෲ",

        "ෙ" + "ෟ": "ෞ",
        "ෟ" + "ෙ": "ෞ",

        "ි" + "ී": "ී",
        "ී" + "ි": "ී",

        # duplicating same symbol
        "ේ" + "්": "ේ",
        "ේ" + "ෙ": "ේ",

        "ො" + "ා": "ො",
        "ො" + "ෙ": "ො",

        "ෝ" + "ා": "ෝ",
        "ෝ" + "්": "ෝ",
        "ෝ" + "ෙ": "ෝ",
        "ෝ" + "ේ": "ෝ",
        "ෝ" + "ො": "ෝ",

        "ෞ" + "ෟ": "ෞ",
        "ෞ" + "ෙ": "ෞ",

        # special cases - may be typing mistakes
        "ො" + "ෟ": "ෞ",
        "ෟ" + "ො": "ෞ",
    }
